<a href="https://colab.research.google.com/github/Veebug/3-Par-Kenya/blob/master/Moringa_Data_Science_Prep_W3_Independent_Project_2021_11_Victoria_Ondieki_DataReport.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd

In [4]:
geo_df=pd.read_csv("cells_geo.csv")
geo_df.head()

  ;VILLES;STATUS;LOCALISATION;DECOUPZONE;ZONENAME;LONGITUDE;LATITUDE;REGION;AREA;CELL_ID;SITE_CODE
0  0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
1  1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
2  2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
3  3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
4  4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...

In [5]:
cdr_descr_df=pd.read_excel("CDR_description.xlsx")
cdr_descr_df.head()

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String

In [6]:
geo_descr_df=pd.read_excel("cells_geo_description.xlsx")
geo_descr_df.head()

    Column name        Description  Format
0        VILLES               City  String
1        STATUS  In Service or not  String
2  LOCALISATION  in ABIDJAN or not  String
3    DECOUPZONE  Geographical Zone  String
4      ZONENAME       Name of Zone  String

In [7]:
#creating dataset1 from url
dataset1_df=pd.read_csv("http://bit.ly/TelecomDataset1")
dataset1_df.head()

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [8]:
dataset1_df.describe()

              VALUE
count  1.501182e+07
mean   4.255369e+01
std    9.046932e+01
min    0.000000e+00
25%    0.000000e+00
50%    1.400000e+01
75%    5.400000e+01
max    2.496000e+04

In [ ]:
#creating dataset2 from url
dataset2_df=pd.read_csv("http://bit.ly/TelecomDataset2")
dataset2_df.head()

In [ ]:
dataset2_df.describe()

In [11]:
#creating dataset3 from url
dataset3_df=pd.read_csv("http://bit.ly/TelecomDataset3")
dataset3_df.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [ ]:
dataset3_df.describe()

In [10]:
#cleaning cells_geo.csv
#checking for nulls and duplicates
geo.isnull().values.any()
geo.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
3969    False
3970    False
3971    False
3972    False
3973    False
Length: 3974, dtype: bool

In [ ]:
#cleaning first telecom dataset
#dropping columns we dont need
dataset1_df.drop('COUNTRY_A','COUNTRY_B'axis=1).head()

dataset1_df.isnull()

#grouping by voice and sms
dataset1_df.groupby(['PRODUCT']).mean()

In [ ]:
#cleaning second telecom dataset
#dropping columns we dont need
dataset2.drop("COUNTRY_A",axis=1,inplace=True)
dataset2.drop("COUNTRY_B",axis=1,inplace=True)

#checking for duplicates
dataset2.duplicated()
dataset2=dataset2.drop_duplicated()
dataset2.isnull.values.any()
dataset2=dataset2.fillna("Not Identified")
dataset2.head()

In [2]:
#cleaning third telecom dataset
#dropping columns we dont need
dataset3.drop("COUNTRY_A",axis=1,inplace=True)
dataset3.drop("COUNTRY_B",axis=1,inplace=True)

#checking for duplicates
dataset3.duplicated()
dataset3=dataset3.drop_duplicated()
dataset3.isnull.values.any()
dataset3=dataset3.fillna("Not Identified")
dataset3.head()

NameError: ignored

In [ ]:
#removing spelling errors to allow the columns to merge
dataset1.columns.values[0:1] = ["PRODUCT"]
dataset1.columns.values[2:3] = ["DATE_TIME"]

dataset2.columns.value[3:5] = ["DW_A_NUMBER_INT","DW_B_NUMBER_INT"]
dataset3.columns.value[5:] = ["CELL_ID","SITE_ID"]

In [ ]:
#MERGING